{
  "architectures": [
    "StableLmForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "eos_token_id": 100278,
  "hidden_act": "silu",
  "hidden_dropout": 0.0,
  "hidden_size": 5120,
  "initializer_range": 0.01,
  "intermediate_size": 13824,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 4096,
  "model_type": "stablelm",
  "num_attention_heads": 32,
  "num_hidden_layers": 40,
  "num_key_value_heads": 8,
  "partial_rotary_factor": 0.25,
  "qk_layernorm": true,
  "rope_scaling": null,
  "rope_theta": 10000,
  "rotary_scaling_factor": 1.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0",
  "use_cache": true,
  "use_norm_bias": false,
  "use_parallel_residual": true,
  "use_qkv_bias": false,
  "vocab_size": 100352
}